Chenwhich778/EDC_Control/car_driver_mspm0/car_driver_mspm0/empty_mspm0g3507.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.01"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.01"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const COMPARE       = scripting.addModule("/ti/driverlib/COMPARE", {}, false);
const COMPARE1      = COMPARE.addInstance();
const COMPARE2      = COMPARE.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const NONMAIN       = scripting.addModule("/ti/driverlib/NONMAIN");
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const PWM3          = PWM.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const TIMER2        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const UART4         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
ADC121.$name                             = "VCC_ADC";
ADC121.sampClkDiv                        = "DL_ADC12_CLOCK_DIVIDE_8";
ADC121.repeatMode                        = true;
ADC121.sampleTime0                       = "100 us";
ADC121.enabledInterrupts                 = ["DL_ADC12_INTERRUPT_MEM0_RESULT_LOADED"];
ADC121.samplingOperationMode             = "sequence";
ADC121.peripheral.adcPin0.$assign        = "PA15";
ADC121.adcPin0Config.hideOutputInversion = scripting.forceWrite(false);
ADC121.adcPin0Config.$name               = "ti_driverlib_gpio_GPIOPinGeneric9";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

COMPARE1.ccIndex                            = 1;
COMPARE1.timerClkPrescale                   = 2;
COMPARE1.timerPeriod                        = 1;
COMPARE1.interrupts                         = ["LOAD"];
COMPARE1.$name                              = "TIMER_M4";
COMPARE1.peripheral.ccp1Pin.$assign         = "PB18";
COMPARE1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
COMPARE1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
COMPARE1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
COMPARE1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";

COMPARE2.$name                              = "TIMER_M3";
COMPARE2.timerClkPrescale                   = 2;
COMPARE2.timerPeriod                        = 1;
COMPARE2.interrupts                         = ["LOAD"];
COMPARE2.peripheral.ccp0Pin.$assign         = "PB21";
COMPARE2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
COMPARE2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
COMPARE2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
COMPARE2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric14";

GPIO1.port                                = "PORTB";
GPIO1.$name                               = "KEY1";
GPIO1.associatedPins[0].$name             = "PB5";
GPIO1.associatedPins[0].direction         = "INPUT";
GPIO1.associatedPins[0].interruptEn       = true;
GPIO1.associatedPins[0].polarity          = "FALL";
GPIO1.associatedPins[0].interruptPriority = "1";
GPIO1.associatedPins[0].pin.$assign       = "PB5";

GPIO2.$name                         = "OLED";
GPIO2.associatedPins.create(3);
GPIO2.associatedPins[0].$name       = "RESET";
GPIO2.associatedPins[0].pin.$assign = "PB9";
GPIO2.associatedPins[1].$name       = "DC";
GPIO2.associatedPins[1].pin.$assign = "PB10";
GPIO2.associatedPins[2].$name       = "CS";
GPIO2.associatedPins[2].pin.$assign = "PA3";

GPIO3.$name                         = "MOTOR1";
GPIO3.associatedPins.create(4);
GPIO3.associatedPins[0].$name       = "CTRL1";
GPIO3.associatedPins[1].$name       = "CTRL2";
GPIO3.associatedPins[1].pin.$assign = "PB17";
GPIO3.associatedPins[2].direction   = "INPUT";
GPIO3.associatedPins[2].interruptEn = true;
GPIO3.associatedPins[2].polarity    = "FALL";
GPIO3.associatedPins[2].$name       = "ENCA1";
GPIO3.associatedPins[3].direction   = "INPUT";
GPIO3.associatedPins[3].polarity    = "FALL";
GPIO3.associatedPins[3].$name       = "ENCB1";

GPIO4.$name                         = "MOTOR2";
GPIO4.associatedPins.create(4);
GPIO4.associatedPins[0].$name       = "CTRL3";
GPIO4.associatedPins[0].pin.$assign = "PA25";
GPIO4.associatedPins[1].$name       = "CTRL4";
GPIO4.associatedPins[1].pin.$assign = "PB26";
GPIO4.associatedPins[2].$name       = "ENCA2";
GPIO4.associatedPins[2].direction   = "INPUT";
GPIO4.associatedPins[2].interruptEn = true;
GPIO4.associatedPins[2].polarity    = "FALL";
GPIO4.associatedPins[2].pin.$assign = "PB23";
GPIO4.associatedPins[3].$name       = "ENCB2";
GPIO4.associatedPins[3].direction   = "INPUT";
GPIO4.associatedPins[3].pin.$assign = "PB22";

GPIO5.$name                         = "MOTOR3";
GPIO5.associatedPins.create(3);
GPIO5.associatedPins[0].$name       = "CTRL5";
GPIO5.associatedPins[0].pin.$assign = "PB27";
GPIO5.associatedPins[1].$name       = "CTRL6";
GPIO5.associatedPins[1].pin.$assign = "PA5";
GPIO5.associatedPins[2].$name       = "ENCB3";
GPIO5.associatedPins[2].direction   = "INPUT";
GPIO5.associatedPins[2].pin.$assign = "PB20";

GPIO6.$name                         = "MOTOR4";
GPIO6.associatedPins.create(3);
GPIO6.associatedPins[0].$name       = "CTRL7";
GPIO6.associatedPins[0].pin.$assign = "PA6";
GPIO6.associatedPins[1].$name       = "CTRL8";
GPIO6.associatedPins[1].pin.$assign = "PB1";
GPIO6.associatedPins[2].$name       = "ENCA4";
GPIO6.associatedPins[2].direction   = "INPUT";
GPIO6.associatedPins[2].interruptEn = true;
GPIO6.associatedPins[2].polarity    = "FALL";
GPIO6.associatedPins[2].pin.$assign = "PB19";

GPIO7.$name                              = "SPI0";
GPIO7.associatedPins[0].$name            = "CS0";
GPIO7.associatedPins[0].internalResistor = "PULL_UP";
GPIO7.associatedPins[0].pin.$assign      = "PA8";

