Chenwhich778/EDC_Control/car_driver_mspm0/car_driver_mspm0/empty_mspm0g3507.syscfg
GPIO8.$name                         = "RGB_GB";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].$name       = "G";
GPIO8.associatedPins[0].pin.$assign = "PA24";
GPIO8.associatedPins[1].$name       = "B";
GPIO8.associatedPins[1].pin.$assign = "PB0";

GPIO9.$name                         = "GPIO_SENSOR";
GPIO9.associatedPins.create(7);
GPIO9.associatedPins[0].$name       = "PIN_0";
GPIO9.associatedPins[0].direction   = "INPUT";
GPIO9.associatedPins[0].ioStructure = "SD";
GPIO9.associatedPins[0].pin.$assign = "PB6";
GPIO9.associatedPins[1].$name       = "PIN_1";
GPIO9.associatedPins[1].direction   = "INPUT";
GPIO9.associatedPins[1].pin.$assign = "PA9";
GPIO9.associatedPins[2].$name       = "PIN_2";
GPIO9.associatedPins[2].direction   = "INPUT";
GPIO9.associatedPins[2].pin.$assign = "PB11";
GPIO9.associatedPins[3].$name       = "PIN_3";
GPIO9.associatedPins[3].direction   = "INPUT";
GPIO9.associatedPins[3].pin.$assign = "PB3";
GPIO9.associatedPins[4].$name       = "PIN_4";
GPIO9.associatedPins[4].direction   = "INPUT";
GPIO9.associatedPins[4].pin.$assign = "PA16";
GPIO9.associatedPins[5].$name       = "PIN_5";
GPIO9.associatedPins[5].direction   = "INPUT";
GPIO9.associatedPins[5].pin.$assign = "PB16";
GPIO9.associatedPins[6].$name       = "PIN_6";
GPIO9.associatedPins[6].direction   = "INPUT";
GPIO9.associatedPins[6].pin.$assign = "PA2";

I2C1.$name                   = "I2C_0";
I2C1.basicEnableController   = true;
I2C1.advControllerRXFIFOTRIG = "BYTES_8";
I2C1.advControllerTXFIFOTRIG = "BYTES_7";
I2C1.sdaPinConfig.$name      = "ti_driverlib_gpio_GPIOPinGeneric8";
I2C1.sclPinConfig.$name      = "ti_driverlib_gpio_GPIOPinGeneric15";

NONMAIN.nonmainWarning    = true;
NONMAIN.bslInvokePinCheck = false;

PWM1.$name                              = "PWM_G0";
PWM1.clockPrescale                      = 10;
PWM1.clockDivider                       = 8;
PWM1.timerStartTimer                    = true;
PWM1.peripheral.$assign                 = "TIMG0";
PWM1.peripheral.ccp0Pin.$assign         = "PA23";
PWM1.peripheral.ccp1Pin.$assign         = "PA13";
PWM1.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric5";
PWM1.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");

PWM2.timerStartTimer                    = true;
PWM2.$name                              = "PWM_MOTOR_1_2";
PWM2.peripheral.$assign                 = "TIMG7";
PWM2.peripheral.ccp0Pin.$assign         = "PA26";
PWM2.peripheral.ccp1Pin.$assign         = "PA4";
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC4";
PWM2.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC5";
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
PWM2.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";

PWM3.$name                              = "PWM_MOTOR_3_4";
PWM3.timerStartTimer                    = true;
PWM3.peripheral.$assign                 = "TIMG6";
PWM3.peripheral.ccp0Pin.$assign         = "PA29";
PWM3.peripheral.ccp1Pin.$assign         = "PA30";
PWM3.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC6";
PWM3.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC7";
PWM3.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
PWM3.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";

SPI1.$name                      = "SPI_0";
SPI1.phase                      = "1";
SPI1.targetBitRate              = 16000000;
SPI1.chipSelect                 = ["0","1"];
SPI1.polarity                   = "1";
SPI1.frameFormat                = "MOTO3";
SPI1.sclkPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric2";
SPI1.mosiPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric3";
SPI1.misoPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric4";
SPI1.peripheral.$assign         = "SPI0";
SPI1.peripheral.sclkPin.$assign = "PA11";
SPI1.peripheral.mosiPin.$assign = "PA14";
SPI1.peripheral.misoPin.$assign = "PA10";


TIMER1.timerMode          = "PERIODIC";
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerClkPrescale   = 20;
TIMER1.$name              = "TIMER_A0_100us";
TIMER1.timerStartTimer    = true;
TIMER1.timerPeriod        = "100 us";
TIMER1.peripheral.$assign = "TIMA0";

